# Тесты для лабораторной работы №01 (задача №5)

## Входные данные
> Целое *n*

## Выходные данные
> Последовательность простых множителей числа *n*

## Позитивные тесты
 - 01 - обычный тест
 - 02 - в качестве n единица
 - 03 - n - простое

## Негативные тесты
 - 01 - n - не натуральное число
 - 02 - n - не число


 ### **Для корректного тестирования в системе MSYS2, необходимо в функцию printf добавить возврат каретки `\r`**
 ```c
11.    printf("%d\r\n", i);
 ``` 
